# DataFrame Structure Methods

In this chapter, we cover several different methods that change the structure of the DataFrame. We will be adding,  dropping, and renaming rows and columns from our DataFrame.

## Adding a new column to the DataFrame

A new column may be added to a DataFrame using similar syntax as selecting a single column with *just the brackets*. This is done without the use of a method. The general syntax uses an assignment statement as such:

```python
df['new_column'] = <some expression>
```

Let's begin by reading in the college dataset with the institution name set as the index. We'll use a small subset of this DataFrame consisting of the first three rows and six of the columns.

In [8]:
pd.read_csv('../data/dictionaries/college_data_dictionary.csv')

           column_name                                        description
0               instnm                                   Institution Name
1                 city                                      City Location
2               stabbr                                 State Abbreviation
3                 hbcu           Historically Black College or University
4              menonly                                       0/1 Men Only
5            womenonly                                     0/1 Women only
6             relaffil                          0/1 Religious Affiliation
7             satvrmid                                  SAT Verbal Median
8             satmtmid                                    SAT Math Median
9         distanceonly                            Distance Education Only
10                ugds                           Undergraduate Enrollment
11          ugds_white                            Percent Undergrad White
12          ugds_black                            Percent Undergrad Black
13           ugds_hisp                         Percent Undergrad Hispanic
14          ugds_asian                            Percent Undergrad Asian
15           ugds_aian   Percent Undergrad American Indian/Alaskan Native
16           ugds_nhpi  Percent Undergrad Native Hawaiian/Pacific Isla...
17           ugds_2mor                  Percent Undergrad 2 or more races
18            ugds_nra              Percent Undergrad non-resident aliens
19           ugds_unkn                     Percent Undergrad race unknown
20            pptug_ef                         Percent Students part-time
21            curroper                            0/1 Currently Operating
22             pctpell                   Percent Students with Pell grant
23            pctfloan                 Percent Students with federal loan
24             ug25abv                     Percent Students Older than 25
25     md_earn_wne_p10          Median Earnings 10 years after enrollment
26  grad_debt_mdn_supp                          Median debt of completers

In [7]:
import pandas as pd
college = pd.read_csv('../data/college.csv', index_col='instnm')
cols = ['city', 'stabbr', 'relaffil', 'satvrmid', 'satmtmid', 'ugds']
cs = college[cols].head(3)
cs

,city,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4206.0
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,11383.0
Amridge University,Montgomery,AL,1,NaN,NaN,291.0

### Reading in a subset of columns with the `usecols` parameter

The above set of commands is suboptimal. Instead of reading in all of the columns in the college dataset with the `read_csv` function, we can choose a subset to read with the `usecols` parameter. Pass it a list of the columns we want to read in. We can also use the `nrows` parameter to read in exactly `n` rows.

In [2]:
%%time

cols = ['instnm', 'city', 'stabbr', 'relaffil', 'satvrmid', 'satmtmid', 'ugds']
cs = pd.read_csv('../data/college.csv', index_col='instnm', usecols=cols, nrows=3)
cs

CPU times: total: 31.2 ms
Wall time: 4 ms

,city,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4206.0
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,11383.0
Amridge University,Montgomery,AL,1,NaN,NaN,291.0

Let's add the two SAT columns together and assign the result as a new column. The new column will always be appended to the end of the DataFrame.

In [9]:
cs['sat_total'] = cs['satmtmid'] + cs['satvrmid']
cs

,city,stabbr,relaffil,satvrmid,satmtmid,ugds,sat_total
instnm,,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4206.0,844.0
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,11383.0,1135.0
Amridge University,Montgomery,AL,1,NaN,NaN,291.0,NaN

### Setting a column equal to a scalar value

You can create a new column by assigning it to be a single scalar value. For instance, the following assignment creates a new column of values equal to the number -99.

In [10]:
cs['some_num'] = -99
cs

,city,stabbr,relaffil,satvrmid,satmtmid,ugds,sat_total,some_num
instnm,,,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4206.0,844.0,-99
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,11383.0,1135.0,-99
Amridge University,Montgomery,AL,1,NaN,NaN,291.0,NaN,-99

### Overwriting an existing column

You can replace the contents of an existing column by assigning it to some other value. Below, we increase the undergraduate population of each college by 10%.

In [11]:
cs['ugds'] = cs['ugds'] * 1.1
cs

,city,stabbr,relaffil,satvrmid,satmtmid,ugds,sat_total,some_num
instnm,,,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4626.6,844.0,-99
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,12521.3,1135.0,-99
Amridge University,Montgomery,AL,1,NaN,NaN,320.1,NaN,-99

### Create a new column from a numpy array

You can create a new column by assigning it to a numpy array (or another Python sequence) that is the same length as the DataFrame. Below, we create a column of random normal variables.

In [12]:
import numpy as np
cs['random_normal'] = np.random.randn(len(cs))
cs

,city,stabbr,relaffil,satvrmid,satmtmid,ugds,sat_total,some_num,random_normal
instnm,,,,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4626.6,844.0,-99,1.571179
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,12521.3,1135.0,-99,0.126258
Amridge University,Montgomery,AL,1,NaN,NaN,320.1,NaN,-99,1.578899

## Copying a DataFrame

The `copy` method is available to make a completely new copy of a DataFrame that is not associated with the original. This may be necessary in some situations because assigning a DataFrame to a new variable does not copy it. Let's read in a sample DataFrame and assign it to the variable name `df`.

In [13]:
df = pd.read_csv('../data/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

We can create a new variable name by assigning it to `df`. This does not make a new copy of the data.

In [14]:
df1 = df
df1

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

If you are unfamiliar with Python, you might make the mistake and assume that `df` and `df1` reference different DataFrames. What we have, is a single DataFrame object that is referenced by two different variable names. We can verify this with the `is` operator.

In [15]:
df is df1

True

Let's further demonstrate this by modifying `df` by adding a new column to it.

In [16]:
df['new_col'] = 5
df

          state  color    food  age  height  score  new_col
name
Jane         NY   blue   Steak   30     165    4.6        5
Niko         TX  green    Lamb    2      70    8.3        5
Aaron        FL    red   Mango   12     120    9.0        5
Penelope     AL  white   Apple    4      80    3.3        5
Dean         AK   gray  Cheese   32     180    1.8        5
Christina    TX  black   Melon   33     172    9.5        5
Cornelia     TX    red   Beans   69     150    2.2        5

Let's now output `df1` to show that it too has changed.

In [17]:
df1

          state  color    food  age  height  score  new_col
name
Jane         NY   blue   Steak   30     165    4.6        5
Niko         TX  green    Lamb    2      70    8.3        5
Aaron        FL    red   Mango   12     120    9.0        5
Penelope     AL  white   Apple    4      80    3.3        5
Dean         AK   gray  Cheese   32     180    1.8        5
Christina    TX  black   Melon   33     172    9.5        5
Cornelia     TX    red   Beans   69     150    2.2        5

The variables `df` and `df1` are two different names that reference the same underlying DataFrame. If you'd like to create a completely new DataFrame with the same data, you need to use the `copy` method. Let's reread in the same dataset again, but this time assign `df1` to a copy of `df`.

In [18]:
df = pd.read_csv('../data/sample_data.csv', index_col=0)
df1 = df.copy()

Testing whether `df` and `df1` reference the same DataFrame will now yield `False`.

In [19]:
df is df1

False

If we add a column to `df` it will have no effect on `df1`.

In [20]:
df['new_col'] = 5
df

          state  color    food  age  height  score  new_col
name
Jane         NY   blue   Steak   30     165    4.6        5
Niko         TX  green    Lamb    2      70    8.3        5
Aaron        FL    red   Mango   12     120    9.0        5
Penelope     AL  white   Apple    4      80    3.3        5
Dean         AK   gray  Cheese   32     180    1.8        5
Christina    TX  black   Melon   33     172    9.5        5
Cornelia     TX    red   Beans   69     150    2.2        5

Outputting `df1` shows that it is unchanged.

In [21]:
df1

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

##  Column and Row Dropping and Renaming

pandas provides the `drop` method to remove rows or columns from the DataFrame and the `rename` method to rename the row or column labels.

### Dropping Columns

The `drop` method drops columns passed to the `columns` parameter by setting it to either a string or a list of strings. Let's see examples of dropping a single column and then multiple columns. Remember, methods return completely new objects, so the original DataFrame is not affected. You'll need to assign the result of the operation to a new variable name if you'd like to proceed with the slimmer DataFrame.

In [22]:
cs.drop(columns='city')

,stabbr,relaffil,satvrmid,satmtmid,ugds,sat_total,some_num,random_normal
instnm,,,,,,,,
Alabama A & M University,AL,0,424.0,420.0,4626.6,844.0,-99,1.571179
University of Alabama at Birmingham,AL,0,570.0,565.0,12521.3,1135.0,-99,0.126258
Amridge University,AL,1,NaN,NaN,320.1,NaN,-99,1.578899

Use a list to drop multiple columns.

In [25]:
cols = ['city', 'stabbr', 'satvrmid']
cs.drop(columns=cols)

,relaffil,satmtmid,ugds,sat_total,some_num,random_normal
instnm,,,,,,
Alabama A & M University,0,420.0,4626.6,844.0,-99,1.571179
University of Alabama at Birmingham,0,565.0,12521.3,1135.0,-99,0.126258
Amridge University,1,NaN,320.1,NaN,-99,1.578899

You can also drop rows by **label** and not integer location with the `drop` method using a single label or a list of labels.

In [26]:
rows = ['Alabama A & M University', 'University of Alabama at Birmingham']
cs.drop(index=rows)

,city,stabbr,relaffil,satvrmid,satmtmid,ugds,sat_total,some_num,random_normal
instnm,,,,,,,,,
Amridge University,Montgomery,AL,1,NaN,NaN,320.1,NaN,-99,1.578899

### Renaming Columns

The `rename` method is used to rename columns. Pass a dictionary to the `columns` parameter with keys equal to the old column name and values equal to the new column name. The college dataset has lots of columns with abbreviations that are not immediately recognized. Below, we replace a couple of these columns with more verbose names.

In [ ]:
cs.rename(columns={'stabbr': 'state_abbreviation',
                   'relaffil': 'religious_affiliation'})

### Renaming all columns at once

Instead of using the `rename` method to rename individual columns, you can assign the `columns` attribute a list of the new column names. The length of the list must be the same as the number of columns. Let's first save the original column names to their own variable name so that we can use them in the future.

In [29]:
orig_cols = cs.columns
orig_cols

Index(['city', 'stabbr', 'relaffil', 'satvrmid', 'satmtmid', 'ugds',
       'sat_total', 'some_num', 'random_normal'],
      dtype='object')

Let's overwrite all of the old columns by assigning them to a list of new column names. Overwriting columns like this does so in-place without making a new copy of the DataFrame.

In [30]:
cs.columns = ['CITY', 'STATE', 'RELAFFIL', 'SATVERBAL', 'SATMATH', 
              'UGDS', 'SAT_TOTAL', 'SOME_NUM', 'RN']
cs

,CITY,STATE,RELAFFIL,SATVERBAL,SATMATH,UGDS,SAT_TOTAL,SOME_NUM,RN
instnm,,,,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4626.6,844.0,-99,1.571179
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,12521.3,1135.0,-99,0.126258
Amridge University,Montgomery,AL,1,NaN,NaN,320.1,NaN,-99,1.578899

Let's overwrite these column names again so that they are back to the original names.

In [31]:
cs.columns = orig_cols
cs

,city,stabbr,relaffil,satvrmid,satmtmid,ugds,sat_total,some_num,random_normal
instnm,,,,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4626.6,844.0,-99,1.571179
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,12521.3,1135.0,-99,0.126258
Amridge University,Montgomery,AL,1,NaN,NaN,320.1,NaN,-99,1.578899

## Inserting columns in the middle of a DataFrame

We previously learned about adding a new column to a DataFrame using just the brackets. New columns are always appended to the end of the DataFrame. You can instead use the `insert` method to place the new column in a specific location other than the end. This method has the following three required parameters:

* `loc` - the integer location of the new column
* `column` - the name of the new column
* `value` - the values of the new column

This method works **in-place** and is one of the only ones that does so by default. This means that the calling DataFrame gets modified and nothing is returned. There is no assignment statement when using `insert`. Let's insert the same SAT total right after the `satmtmid` column. We will call it `sat_total_insert` to differentiate it from the column on the end.

In [ ]:
new_vals = cs['satvrmid'] + cs['satmtmid']
cs.insert(5, 'sat_total_insert', new_vals)
cs

One minor annoyance is that you must know the integer location of where you'd like to insert the new column. In the above example, it's easy-enough to just count by hand, but a more automated solution would be nice. The pandas Index object has a method called `get_loc` which returns the integer location of a column name. 

This is a rare instance in this book where an Index method is used. I advise not digging into Index objects unless there is some very specialized need. So, with some hesitation, I present the `get_loc` Index method here. First, access the `columns` attribute (which is an Index object) and pass the `get_loc` method the name of the column.

In [32]:
cs.columns.get_loc('satmtmid')

4

Make note that the `get_loc` method does not exist for Series or DataFrame objects. It is strictly an Index method available to either the index or the columns.

### Comparison to Python lists

The DataFrame `insert` method is analogous to a Python list method with the same name. It too inserts a value into the list in-place given an integer location. Let's complete an example to compare how it works.

In [33]:
a = ['some', 'list', 'of', 'strings']
a

['some', 'list', 'of', 'strings']

Call the list `insert` method which mutates the list in-place.

In [34]:
a.insert(1, 'short')
a

['some', 'short', 'list', 'of', 'strings']

There's also an `index` method that returns the integer location of a particular item in the list which is analogous to the `get_loc` method.

In [35]:
a.index('of')

3

## The `pop` method

The DataFrame `pop` method removes a single column from a DataFrame and returns it as a Series. This is different than the `drop` method which removes a column or columns and returns a new DataFrame of the remaining columns. The `pop` method modifies the calling DataFrame in-place. Below, we remove the `ugds` column and assign it to a variable with the same name.

In [ ]:
cols = ['instnm', 'city', 'stabbr', 'relaffil', 'satvrmid', 'satmtmid', 'ugds']
cs = pd.read_csv('../data/college.csv', index_col='instnm', usecols=cols, nrows=3)
cs

,city,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4206.0
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,11383.0
Amridge University,Montgomery,AL,1,NaN,NaN,291.0

In [37]:
ugds = cs.pop('ugds')
ugds

instnm
Alabama A & M University                4626.6
University of Alabama at Birmingham    12521.3
Amridge University                       320.1
Name: ugds, dtype: float64

The `cs` DataFrame no longer contains the `ugds` column.

In [38]:
cs

,city,stabbr,relaffil,satvrmid,satmtmid,sat_total,some_num,random_normal
instnm,,,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,844.0,-99,1.571179
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,1135.0,-99,0.126258
Amridge University,Montgomery,AL,1,NaN,NaN,NaN,-99,1.578899

## Exercises

Run the cell below to create a variable name `college_all` that contains all of the rows of the college dataset along with six of the columns. We use the `

In [47]:
cols = ['instnm', 'city', 'stabbr', 'relaffil', 'satvrmid', 'satmtmid', 'ugds']
college_all = pd.read_csv('../data/college.csv', index_col='instnm', usecols=cols)
college_all.head()

,city,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4206.0
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,11383.0
Amridge University,Montgomery,AL,1,NaN,NaN,291.0
University of Alabama in Huntsville,Huntsville,AL,0,595.0,590.0,5451.0
Alabama State University,Montgomery,AL,0,425.0,430.0,4811.0

### Exercise 1

<span style="color:green; font-size:16px">Create a new boolean column in the `college_all` DataFrame named 'Verbal Higher' that is True for every college that has a higher verbal than math SAT score. Find the mean of this new column. Why does this number look suspiciously low?</span>

In [49]:
college_all['Verbal Higher']  = college_all['satvrmid'] > college_all['satmtmid']

In [53]:
(college_all['satvrmid'] > college_all['satmtmid']).sum() / len(college_all)

np.float64(0.048042468480424684)

In [ ]:
college_all['Verbal Higher'].mean()

#it is low because of missing values

np.float64(0.048042468480424684)

### Exercise 2

<span style="color:green; font-size:16px">Find the real percentage of schools with higher verbal than math SAT scores.</span>

In [56]:
college_all.size

52745

In [55]:
college_all['satvrmid'].isna().sum()

np.int64(6350)

In [57]:
college_all['satmtmid'].isna().sum()

np.int64(6339)

In [68]:
college_all.dropna(subset=['satvrmid','satmtmid'])['Verbal Higher'].mean()

np.float64(0.30574324324324326)

### Exercise 3

<span style="color:green; font-size:16px">Create a new column called 'median all' that has every value set to the median population of all the schools.</span>

In [72]:
college_all['median_all'] = college_all['ugds'].median()

college_all

,city,stabbr,relaffil,satvrmid,satmtmid,ugds,Verbal Higher,median_all
instnm,,,,,,,,
Alabama A & M University,Normal,AL,0,424.0,420.0,4206.0,True,412.5
University of Alabama at Birmingham,Birmingham,AL,0,570.0,565.0,11383.0,True,412.5
Amridge University,Montgomery,AL,1,NaN,NaN,291.0,False,412.5
University of Alabama in Huntsville,Huntsville,AL,0,595.0,590.0,5451.0,True,412.5
Alabama State University,Montgomery,AL,0,425.0,430.0,4811.0,False,412.5
...,...,...,...,...,...,...,...,...
SAE Institute of Technology San Francisco,Emeryville,CA,1,NaN,NaN,NaN,False,412.5
Rasmussen College - Overland Park,Overland Park,KS,1,NaN,NaN,NaN,False,412.5
National Personal Training Institute of Cleveland,Highland Heights,OH,1,NaN,NaN,NaN,False,412.5
Bay Area Medical Academy - San Jose Satellite Location,San Jose,CA,1,NaN,NaN,NaN,False,412.5
Excel Learning Center-San Antonio South,San Antonio,TX,1,NaN,NaN,NaN,False,412.5

### Exercise 4

<span style="color:green; font-size:16px">Rename the row label 'Texas A &amp; M University-College Station' to 'TAMU'. Reassign the result back to `college_all` and then select this row as a Series.</span>

In [74]:
college_all = college_all.rename(index={'Texas A & M University-College Station':'TAMU'})

In [78]:
college_all.loc['TAMU',:]

city             College Station
stabbr                        TX
relaffil                       0
satvrmid                   580.0
satmtmid                   615.0
ugds                     46941.0
Verbal Higher              False
median_all                 412.5
Name: TAMU, dtype: object

### Use the City of Houston employee dataset

Execute the following cell to read in the City of Houston employee dataset and use it for the remaining problems.

In [85]:
emp = pd.read_csv('../data/employee.csv')
emp.head(3)

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black

### Exercise 5

<span style="color:green; font-size:16px">Create a new column named `bonus` and insert it right after the salary column equal. Have its value equal to 10% of the salary. Round the bonus to the nearest thousand.</span>

In [86]:
idx = emp.columns.get_loc('salary') + 1 

emp.insert(idx,'bonus',(emp['salary']* 0.1).round(-3))

In [87]:
emp

,dept,title,hire_date,salary,bonus,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,9000.0,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,8000.0,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,5000.0,Male,Black
3,Police,SENIOR POLICE OFFICER,1997-05-27,75942.10,8000.0,Male,Hispanic
4,Police,SENIOR POLICE OFFICER,2006-01-23,69355.26,7000.0,Male,White
...,...,...,...,...,...,...,...
24303,Police,SENIOR POLICE OFFICER,2001-12-03,75942.10,8000.0,Male,Black
24304,Other,SENIOR PROCUREMENT SPECIALIST,2016-03-28,76175.00,8000.0,Female,Black
24305,Houston Public Works,WATER SERVICE INSPECTOR I,2015-09-14,35173.00,4000.0,Male,Black
24306,Health & Human Services,HUMAN SERVICE PROGRAM MANAGER,2008-05-19,67198.00,7000.0,Female,Black
24307,Police,POLICE SERGEANT,1984-05-29,NaN,NaN,Male,White